app/Services/MoneyMoneyService.php

select * from `bank_accounts` where `iban` = 'DE39440100460126083465' limit 1
select * from `bank_accounts`
select * from `transactions` where (`mm_ref` = 23038) limit 1
---
    public function importJsonFile(string $file) {
        $fileContent = file_get_contents($file);
        $account = json_decode($fileContent)->account;

        $bankAccount = BankAccount::query()->where('iban', $account->iban)->first();
        if (! $bankAccount) {
            $bankAccount = BankAccount::query()->where('name', $account->name)->first();
        }

        $transactionIds = [];

        MoneyMoneyTransaction::setFilename($file, $bankAccount->id);
        $ownBankAccounts = BankAccount::get()->pluck('iban')->toArray();
        $transactions = MoneyMoneyTransaction::orderBy('booked_on', 'asc')->get();

        $transactions->each(function ($item) use ($bankAccount, $ownBankAccounts, $transactions) {
            $item->bank_account_id = $bankAccount->id;

            if ($item->booking_text !== 'Currency conversion') {
                $item->save();
                $transactionIds[] = $item->id;
                $transaction = Transaction::firstOrNew(['mm_ref' => $item->mm_ref]);
                $transaction->fill($item->toArray());

                /*
                if (! $transaction->number_range_document_numbers_id) {
                    $transaction->number_range_document_numbers_id = NumberRange::createDocumentNumber($transaction, 'booked_on', $bankAccount->prefix);
                }
                */

                if ($bankAccount->bank_code === 'PP' && $transaction->currency !== 'EUR') {
                    $conversionRecords = MoneyMoneyTransaction::where('booking_text', 'Currency conversion')->where('booked_on', $transaction->booked_on->format('Y-m-d'))->get();
                    if ($conversionRecords->count() === 2) {
                        $conversion = $conversionRecords->where('currency', 'EUR')->first();

                        if ($conversion) {

insert into `transactions` (`mm_ref`, `contact_id`, `bank_account_id`, `valued_on`, `booking_text`, `account_number`, `name`, `mandate_reference`, `primanota_number`, `transaction_code`, `comment`, `amount`, `bank_code`, `return_reason`, `purpose`, `end_to_end_reference`, `batch_reference`, `type`, `booking_key`, `currency`, `booked_on`, `org_category`, `is_private`, `is_transit`, `updated_at`, `created_at`) values (23097, 0, 13, '2025-08-26 00:00:00', 'Auszahlung', '', 'GA NR02091202 BLZ370702240326.08/13.20UHR Bon-Bonn10', '', '9301/108', 83, '', -60, '', '', '', '', '', 'Other', 'MSC', 'EUR', '2025-08-26 00:00:00', 'privat\\Barabhebungen', 1, 0, '2025-08-27 12:41:10', '2025-08-27 12:41:10')
update `transactions` set `booking_key` = 'DDT', `account_number` = 'DE26370501981932277583', `name` = 'Lotto Tabakwaren Kalari', `purpose` = 'Lotto Tabakwaren KALARI//Bonn/DE 25-08-2025T23:21:53 Folgenr. 03 Verfalld. 1227', `transaction_code` = 106, `end_to_end_reference` = '55559556100069250825232153', `mandate_reference` = '179776', `primanota_number` = '9075/658', `transactions`.`updated_at` = '2025-08-27 12:41:10' where `id` = 121
---
                    $transaction->contact_id = 0;
                }

                $transaction->save();            }
        });