app/Http/Middleware/HandleInertiaRequests.php

    public function share(Request $request): array
    {
        $tenant = tenant();

        $user = $request->user();

        $runningTimer = $user ? Time::query()
            ->where('user_id', $user->id)
            ->whereNull('end_at')
            ->latest('begin_at')
            ->with(['category', 'project'])
            ->first() : null;
---
select * from `times` where `user_id` = 1 and `end_at` is null order by `begin_at` desc limit 1