app/Http/Controllers/App/Bookkeeping/Transaction/TransactionConfirmController.php

    public function __invoke(Request $request)
    {

        $ids = $request->query('ids');
        $transactionIds = explode(',', $ids);
        $transactions = Transaction::whereIn('id', $transactionIds)->get();

        $transactions->each(function ($transaction) {
            if (!$transaction->is_locked) {
                $transaction->is_locked = true;
                $transaction->save();
            }
        });

        $transactions = Transaction::whereIn('id', $transactionIds)->get();
---
select * from `transactions` where `id` in ('126')
select * from `transactions` where `id` in ('97')
update `transactions` set `is_locked` = 1, `transactions`.`updated_at` = '2025-08-26 20:23:45' where `id` = 97
update `transactions` set `is_locked` = 1, `transactions`.`updated_at` = '2025-08-27 12:45:53' where `id` = 126