app/Http/Controllers/App/Bookkeeping/Transaction/TransactionIndexController.php

    public function __invoke(Request $request, ?BankAccount $bank_account = null)
    {

        if (! $bank_account) {
            $bank_account = BankAccount::query()->orderBy('pos')->first();
        }

        $bank_accounts = BankAccount::orderBy('pos')->get();

        $transactions = Transaction::query()
            ->where('bank_account_id', $bank_account->id)
            ->with('bank_account')
            ->with('contact')
            ->with('account')
            ->with('range_document_number')
            ->with('booking')
            ->orderBy('booked_on', 'DESC')
            ->orderBy('id', 'DESC')
            ->paginate(10);
---
select * from `bank_accounts` order by `pos` asc
select * from `bank_accounts` where `bank_accounts`.`id` in (13)
select * from `contacts` where `contacts`.`id` in (0, 183, 199, 200)
select * from `transactions` where `bank_account_id` = 13 order by `booked_on` desc limit 10 offset 20
select count(*) as aggregate from `transactions` where `bank_account_id` = 13