app/Http/Controllers/App/Contact/ContactDetailsController.php

select * from `countries` where `countries`.`id` in (1)
select * from `payment_deadlines` where `payment_deadlines`.`id` in (0)
select * from `salutations` where `salutations`.`id` in (0)
select * from `titles` where `titles`.`id` in (0)
---
    public function __invoke(Contact $contact)
    {
        $contact->load([
            'salutation',
            'title',
            'favorites',
            'payment_deadline',
            'company' => function ($query) {
                $query->with([
                    'mails' => function ($query) {
                        $query->orderBy('pos')->with('category');
                    },
                    'addresses' => function ($query) {
                        $query->with(['category', 'country']);
                    },
                ]);
            },
            'mails' => function ($query) {
                $query->orderBy('pos')->with('category');
            },
            'addresses' => function ($query) {
                $query->with(['category', 'country']);
            },