app/Http/Controllers/App/Contact/ContactIndexController.php

    public function __invoke(Request $request)
    {

        $view = $request->input('view', 'all');
        $search = $request->input('search', '');

        $contacts = Contact::query()
            ->select([
                'id',
                'name',
                'first_name',
                'company_id',
                'title_id',
                'salutation_id',
                'debtor_number',
                'creditor_number',
            ])
            ->search($search)
            ->view($view)
            ->with('company')
            ->with('salutation')
            ->with('title')
            ->with('favorites')
            ->with(['mails' => function ($query) {
                $query->orderBy('pos');
            }])
            ->with(['phones' => function ($query) {
                $query->orderBy('pos');
            }])
---
select * from `contacts` where `contacts`.`id` in (0, 4)
select count(*) as aggregate from `contacts`
select * from `salutations` where `salutations`.`id` in (0, null, 2)
select * from `titles` where `titles`.`id` in (0)