app/Models/Invoice.php

select * from `contacts` where `contacts`.`id` in (7)
select * from `invoices` where `invoices`.`id` in (0, 94, 118, 153)
select * from `payment_deadlines` where `payment_deadlines`.`id` in (1)
select * from `projects` where `projects`.`id` in (36)
---
    public static function createOrGetPdf(Invoice $invoice, bool $uploadToS3 = false): string
    {
        $invoice = Invoice::query()
            ->with('contact')
            ->with('project')
            ->with('project.manager')
            ->with('contact.tax')
            ->with('payment_deadline')
            ->with('type')
            ->with([
                'lines' => function ($query) {
                    $query->with('rate')->orderBy('pos');
                },
            ])
            ->withSum('lines', 'amount')
            ->withSum('lines', 'tax')
            ->where('id', $invoice->id)
            ->first();