app/Http/Controllers/App/Invoice/InvoiceMarkAsSentController.php

    public function __invoke(Invoice $invoice)
    {
        if (! $invoice->sent_at) {
            $invoice->sent_at = now();
            $invoice->save();
---
update `invoices` set `sent_at` = '2025-08-27 12:09:01', `invoices`.`updated_at` = '2025-08-27 12:09:01' where `id` = 165