app/Http/Controllers/App/Invoice/InvoicePaymentStoreController.php

insert into `payments` (`payable_id`, `payable_type`, `transaction_id`, `issued_on`, `is_currency_difference`, `amount`, `updated_at`, `created_at`) values (94, 'App\\Models\\Invoice', 293, '2025-04-17 00:00:00', 0, 119, '2025-08-27 13:09:26', '2025-08-27 13:09:26')
select * from `transactions` where `id` in ('293')
---
    public function __invoke(Request $request, Invoice $invoice)
    {

        $ids = $request->query('ids');
        $ids = $ids ? explode(',', $ids) : [];
        $invoice
            ->loadSum('lines', 'amount')
            ->loadSum('lines', 'tax');

        $transactions = Transaction::whereIn('id', $ids)->get();
        $transactions->each(function ($transaction) use ($invoice) {
            $payment = new Payment;
            $payment->payable()->associate($invoice);
            $payment->transaction_id = $transaction->id;
            $payment->issued_on = $transaction->booked_on;
            $payment->is_currency_difference = false;

            if ($transaction->remaining_amount > $invoice->amount_gross) {
                $payment->amount = $invoice->amount_gross;
            } else {
                $payment->amount = $transaction->remaining_amount;
            }

            if ($transaction->remaining_amount > 0) {
                $payment->save();
            }
        });