app/Http/Controllers/App/Invoice/InvoiceIndexController.php

select DISTINCT YEAR(issued_on) as year from `invoices` order by YEAR(issued_on) DESC
---
    public function __invoke(Request $request)
    {
        $years = Invoice::query()->selectRaw('DISTINCT YEAR(issued_on) as year')->orderByRaw('YEAR(issued_on) DESC')->get()->pluck('year');

select * from `contacts` where `contacts`.`id` in (0)
select * from `payment_deadlines` where `payment_deadlines`.`id` in (1)
select * from `projects` where `projects`.`id` in (0, 32, 34, 36, 38)
select count(*) as aggregate from `invoices` where year(`issued_on`) = 2025
---
        $stats[0]['total_loss_of_receivables'] = $loss_of_receivables[0]['loss_of_receivables'];


        $invoices = Invoice::query()
            ->with('invoice_contact')
            ->with('contact')
            ->with('project')
            ->with('payment_deadline')
            ->byYear($year)
            ->with('type')
            ->with('lines')
            ->withSum('lines', 'amount')
            ->withSum('lines', 'tax')
            ->orderBy('issued_on', 'desc')
            ->paginate(15);