app/Http/Controllers/App/Invoice/InvoicePaymentCreateController.php

select * from `transactions` where `contact_id` = 7 and not exists (select * from `payments` where `transactions`.`id` = `payments`.`transaction_id` and `payments`.`deleted_at` is null) and `is_locked` = 1
---
    public function __invoke(Invoice $invoice)
    {
        $transactions = Transaction::query()
            ->where('contact_id', $invoice->contact_id)
            ->whereDoesntHave('payments')
            ->where('is_locked', true)
            ->get();