app/Http/Controllers/App/Invoice/InvoiceDetailsEditBaseController.php

select * from `invoice_types` order by `display_name` asc
select * from `projects` where `is_archived` = 0 order by `name` asc
select * from `payment_deadlines` order by `name` asc
select * from `tax_rates` where `tax_rates`.`tax_id` in (1, 3, 5, 6) and `tax_rates`.`deleted_at` is null
---
    public function __invoke(Request $request, Invoice $invoice)
    {
        $invoice
            ->load('invoice_contact')
            ->load('contact')
            ->load('project')
            ->load('payment_deadline')
            ->load('type')
            ->load([
                'lines' => function ($query) {
                    $query->orderBy('pos');
                },
            ])
            ->load('tax')
            ->load('tax.rates')
            ->loadSum('lines', 'amount')
            ->loadSum('lines', 'tax');

        $invoiceTypes = InvoiceType::orderBy('display_name')->get();
        $projects = Project::where('is_archived', false)->orderBy('name')->get();
        $taxes = Tax::with('rates')->orderBy('name')->get();

        return Inertia::render('App/Invoice/InvoiceDetailsEditBaseData', [
            'invoice' => InvoiceData::from($invoice),
            'invoice_types' => InvoiceTypeData::collect($invoiceTypes),
            'projects' => ProjectData::collect($projects),
            'taxes' => TaxData::collect($taxes),
        ]);